FYI - for now I am getting around this issue by setting `kind = "linux` and using the following lifecycle block in my azurerm_app_service_plan resource:
```
lifecycle {
    ignore_changes = [
         kind
    ]
}
```

If I do not ignore the kind property this is what I see in my subsequent plan operations:
```
Terraform will perform the following actions:

  # azurerm_app_service_plan.asp_function must be replaced
-/+ resource "azurerm_app_service_plan" "asp_function" {
      ~ id                           = "/subscriptions/<SUBSCRIPTION_ID>/resourceGroups/<RESOURCE_GROUP_NAME>/providers/Microsoft.Web/serverfarms/<APP_SERVICE_PLAN_NAME>" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "functionapp" -> "Linux" # forces replacement
        location                     = "southcentralus"
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 0 -> (known after apply)
        name                         = "<APP_SERVICE_PLAN_NAME>"
      - per_site_scaling             = false -> null
        reserved                     = true
        resource_group_name          = "<RESOURCE_GROUP_NAME>"
        tags                         = {
            "Component"   = "<APP_NAME>"
            "Environment" = "Prod"
        }

      ~ sku {
          ~ capacity = 0 -> (known after apply)
            size     = "Y1"
            tier     = "Dynamic"
        }
    }
```